Repository: 84000/data-translation-memory
Catalog: toh129-v4.tmx
Source language: bo
Languages: en

source: །དྲན་པ་ཞེས་བྱ་བ་དེ་ནི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྗེས་སུ་དྲན་པའི་ཚིག་གོ།
en: ‘Mindfulness’ is a term for recollecting the aggregates, the elements, and the sense sources.

source: །སྟོང་པ་ཉིད་རྗེས་སུ་དྲན་པའི་ཚིག་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་རྗེས་སུ་དྲན་པའི་ཚིག་དང་།
en: It refers to recollecting emptiness, the absence of marks, and the absence of wishes.

source: དེ་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་ལྷུན་གྱིས་གྲུབ་པའི་རྗེས་སུ་དྲན་པའི་ཚིག་དེ་ནི་ཡང་དག་པའི་དྲན་པ་ཞེས་བྱའོ།
en: Thus, it is a term for the effortless recollection of the absorption of the Thus-Gone One.

source: །གང་གཟུགས་ལ་དབྱེར་མེད་པ་ཤེས་པ་ནི་མཉམ་པ་ཉིད་དང་ཏིང་ངེ་འཛིན་གྱི་ལས་ཡང་དག་པར་བསྒྲུབས་པ་སྟེ།
en: “Correct absorption is to know the indivisible nature of form, which is also the correct practice of the activities related to sameness and absorption.

source: གཟུགས་གང་དང་མཉམ་པ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཡང་དེ་དང་མཉམ་ཞིང་།
en: Knowing the sameness of form also entails knowing the sameness of feelings, perception, formation, and consciousness.

source: ཕུང་པོ་གང་དང་མཉམ་པ་ཏིང་ངེ་འཛིན་ཀྱང་དེ་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: Knowing the sameness of the aggregates, the bodhisattvas will also correctly perceive the sameness of absorption.

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཏིང་ངེ་འཛིན་ཀྱང་དེ་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: They will then also correctly perceive the sameness of the absorption of the Thus-Gone One’s family.

source: །དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཏིང་ངེ་འཛིན་གང་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་པ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: When they perceive the absorption of the Thus-Gone One’s family, they perceive the sameness of all phenomena.

source: །སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་གང་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོའི་ཆོས་ཐམས་ཅད་ཀྱང་དེ་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: When they perceive the sameness of all the qualities of the Buddha, they perceive the sameness of all the qualities of ordinary and immature beings.

source: །ཏིང་ངེ་འཛིན་གང་དང་མཉམ་པ་འདས་པའི་ཕུང་པོ་དང་། ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ཀྱང་དེ་དང་མཉམ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: With the sameness of absorption, they perceive the sameness of the past aggregates, elements, and sense sources.

source: །མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ཀྱང་དེ་བཞིན་དུ་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངོ་།
en: Likewise, they perceive the sameness of the future and present aggregates, elements, and sense sources.

source: །ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ཇི་ལྟ་བ་བཞིན་དུ་ལས་དང་རྣམ་པར་སྨིན་པ་ཡང་དེ་ལྟར་ཡང་དག་པར་རྗེས་སུ་མཐོང་སྟེ།
en: Just as they perceive the aggregates, elements, and sense sources, so they also perceive karma and its ripening.

source: དུས་གསུམ་མཉམ་པའི་ཏིང་ངེ་འཛིན་གྱི་རིགས་ལ་ཞུགས་པ་དེ་ནི་ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅེས་བྱའོ།
en: Thus, the bodhisattvas rest in the type of absorption that equalizes the three times.

source: །གང་གཟུགས་ལ་དེ་ཁོ་ན་ཤེས་པ་དང་དེ་བཞིན་ཉིད་ཤེས་པ་དེ་ནི་བདེན་པ་ཤེས་པ་སྟེ།
en: “Correct knowledge is to know thatness and suchness concerning form and thereby know the truth.

source: ཆོས་ཉིད་ཀྱི་རང་བཞིན་གང་ཡིན་པ་དེ་ནི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་རྣམས་ཀྱི་རང་བཞིན་ནོ། །ཆོས་ཉིད་ཀྱི་རང་བཞིན་མེད་པ་ནི་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ཀྱི་རང་བཞིན་མེད་པར་བདེན་པ་ཉིད་དུ་མོས་སོ།
en: The bodhisattvas feel devotion to the truth that the nature of reality is also the nature of the aggregates, elements, and sense sources and, moreover, that the absence of the nature of reality is also the absence of the nature of the aggregates, elements, and sense sources.

source: །བྱིན་གྱི་རླབས་ཞེས་བྱ་བ་དེ་ནི་སླུ་བ་མེད་པའི་ཆོས་ཉིད་ཀྱི་ཚིག་བླ་དགས་སོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: ‘Transformative power’ refers to the unfailing reality. And why?

source: མི་སླུ་བ་གང་ཡིན་པ་དེ་ནི་བདེན་པའི་ཕྱིར་རོ།
en: Because whatever is unfailing is also true.

source: །དེ་ལ་གནས་པ་ནི་ཡང་དག་པའི་སྨོན་ལམ་བརྗོད་པ་དང་ལས་ཡང་དག་པར་སྤྱོད་པ་མངོན་སུམ་དུ་འགྱུར་ཏེ།
en: When they are grounded in that, they will utter pure aspirations and perform pure activity.

source: ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་དེ་དག་ལ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཀུན་ཏུ་སྟོན་པར་བྱིན་གྱིས་རློབ་བོ།
en: They will be blessed to manifest emanations of the Thus-Gone One based on the aggregates, elements, and sense sources.

source: །སའི་བདེན་པ་ཉིད་གང་དང་མཉམ་པ་ཆུ་དང་མེ་དང་རླུང་གི་བདེན་པ་ཉིད་ཀྱང་དེ་དང་མཉམ་མོ།
en: Knowing the sameness of the truth of the earth element, they will also know the sameness of the truths of the water, fire, and wind elements.

source: །ནམ་མཁའ་དང་ཆོས་དང་སྒྲ་དང་མིག་ཡོར་དང་གཟུགས་བརྙན་དང་། མཚན་ཉིད་དང་བཅས་པ་དང་མཚན་ཉིད་མེད་པ་དང་ཆགས་པ་དང་བཅས་པ་དང་། ཆགས་པ་མ་ཡིན་པ་དང་བསྡུས་པའི་བསྐལ་པ་དང་། རྒྱ་ཆེ་བའི་བསྐལ་པ་དང་གྲངས་ཡོད་པའི་བསྐལ་པ་དང་གྲངས་མེད་པའི་བསྐལ་པ་དང་སངས་རྒྱས་དང་བཅས་པའི་བསྐལ་པ་དང་། སངས་རྒྱས་མི་འབྱུང་བའི་བསྐལ་པ་དང་འདས་པའི་བསྐལ་པ་དང་། མ་འོངས་པའི་བསྐལ་པ་དང་མ་འོངས་པ་དང་འདས་པའི་བསྐལ་པ་དང་། ད་ལྟར་བྱུང་བ་དང་མ་འོངས་པ་དང་འདས་པའི་བསྐལ་པ་དང་འདས་པ་དང་མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་བསྐལ་པ་ཡང་དེ་དང་མཉམ་སྟེ།
en: They will also know the sameness of space, qualities, sounds, optical illusions, and reflections. They will also know the sameness of characteristics and the absence of characteristics, being attached and not being attached, brief and elaborate eons, limited and limitless eons, eons with and without buddhas, past and future eons, future and past eons, and present and future and past eons, as well as past and future and present eons.

source: ཀུན་ནས་ཉོན་མོངས་པའི་བསྐལ་པ་ལ་རྣམ་པར་བྱང་བའི་བསྐལ་པ་དང་། རྣམ་པར་བྱང་བའི་བསྐལ་པ་ལ་ཀུན་ནས་ཉོན་མོངས་པའི་བསྐལ་པ་དང་། བྱིན་གྱི་རླབས་ཀྱི་བསྐལ་པ་ལ་མཉམ་པ་ཉིད་ཀྱི་བསྐལ་པ་འཇུག་སྟེ།
en: Eons of pollution merge with eons of purification, eons of purification with eons of pollution, and blessed eons with eons of sameness.

source: འཇུག་པ་ཤེས་པ་དེ་ལ་མངོན་པར་ཞེན་པ་མེད་པ་དེ་ནི་ཆོས་ཀྱི་དབྱིངས་བདེན་པ་ཉིད་ཀྱི་ཕྱིར་བདེན་པའི་བྱིན་གྱི་རླབས་ཞེས་བྱ་སྟེ།
en: The knowledge of such merging comes from the absence of such concepts. This is the truth of the realm of phenomena, and thus it is also known as the transformative power of truth.

source: གཟུགས་ཉིད་བདེན་པའོ།
en: This is the truth of form.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཉིད་བདེན་པའོ།
en: Likewise, it is the truth of feeling, perception, formation, and consciousness.

source: །དེ་ལ་གནས་པའི་བདེན་པའི་ངག་གང་ཡིན་པ་དེ་བྱིན་གྱིས་བརླབས་ཏེ།
en: All truthful speech that rests within that state is blessed.

source: དེ་ནི་བདེན་པའི་བྱིན་གྱི་རླབས་ཞེས་བྱའོ།
en: Such is the transformative power of truth.

source: །གང་མཉམ་པ་ཉིད་ཀྱི་ཚུལ་གྱིས་གང་གཟུགས་ལ་འཛིན་པ་མེད་པ་དང་། མཆོག་ཏུ་འཛིན་པ་མེད་པ་དང་གཏོང་བ་དང་དོར་བ་དེ་ནི་གཏོང་བའི་བྱིན་གྱི་རླབས་ཞེས་བྱའོ།
en: “Because of resting in equanimity, the bodhisattvas do not grasp at form, are without thoughts, and are generous and renunciate. That is the transformative power of generosity.

source: །གང་གཟུགས་ལ་བླང་བ་མེད་པ་དང་དོར་བ་མེད་པ་ཤེས་པ་དེ་ནི་གཡོ་བ་དང་འགུལ་བ་ཐམས་ཅད་ཞི་བའོ།
en: Knowing not to accept and reject form is the pacification of all movements and fluctuations.

source: །བྱིན་གྱི་རླབས་ཞེས་བྱ་བ་ནི་ཞི་བ་དེ་ལ་གནས་ནས་ཀུན་ནས་ཉོན་མོངས་པ་ནི་རྣམ་པར་བྱང་བར་བྱིན་གྱིས་རློབ་པ་དང་།
en: ‘Transformative power’ refers to the transformation of all pollution into purification as one abides in that peace.

source: རྣམ་པར་བྱང་བ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་བྱིན་གྱིས་རློབ་པ་དང་ཞི་བ་དེ་ལ་གནས་ནས་སྤྱོད་ལམ་ཀུན་ཏུ་བསྟན་པས་ཚངས་པ་ཉེ་བར་ཞི་བའི་སྤྱོད་ལམ་ཅན་རྣམས་ཀྱང་འདོད་པ་སྐྱེད་པ་དང་ལག་ན་རྡོ་རྗེའི་གཟུགས་ཀུན་ཏུ་བསྟན་པས་མ་ཞི་བའི་སྤྱོད་ལམ་ཅན་རྣམས་སམ། བདུད་ཐམས་ཅད་ཀྱང་ཉེ་བར་ཞི་བའི་བྱིན་གྱི་རླབས་ལ་མོས་པར་བྱེད་པའོ།
en: ‘Purification’ is to bless pollution. When resting in that peace, one can demonstrate all types of activities. For example, one can stimulate desire in those who observe celibacy, and by manifesting in the form of Vajrapāṇi one can make those who act in non-peaceful ways, as well as all demons, become interested in the transformative power of peace.

source: །ཉེ་བར་ཞི་བའི་བྱིན་གྱི་རླབས་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ཤིན་ཏུ་ཞི་བ་དང་། ཉེ་བར་ཞི་བ་དང་རབ་ཏུ་ཞི་བ་སྟེ།
en: The transformative power of peace pacifies, calms, and soothes all ordinary and immature beings.

source: ཉེ་བར་ཞི་བའི་བྱིན་གྱི་རླབས་ཐོབ་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དེ་ནི་ཉེ་བར་ཞི་བའི་བྱིན་གྱི་རླབས་ཞེས་བྱའོ།
en: Perceiving the attainment of the transformative power of peace is called the transformative power of thorough pacification.

source: །གང་གདེག་པ་མེད་པ་དང་གཞག་པ་མེད་པའི་ཚུལ་གྱིས་གཟུགས་ལ་ཆོས་ཀྱི་དབྱིངས་དང་དབྱེར་མེད་པར་ཤེས་ཤིང་སྤྲོས་པ་དང་བྲལ་བའི་ཤེས་རབ་ཀྱིས་ཤིན་ཏུ་ཞི་བ་དང་ཉེ་བར་ཞི་བ་དང་།
en: knowing that form is indivisible from the realm of phenomena. This is known without labelling or positing anything.

source: སྤྲོས་པ་མེད་པའི་ཆོས་ཐམས་ཅད་ཕུང་པོ་དང་ཁམས་དང་སྐྱེ་མཆེད་ཐམས་ཅད་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་བྱིན་གྱིས་རློབ་པ་དེ་ནི་
en: With nonconceptual insight, all phenomena related to utter and thorough peace and the freedom from conceptual constructs, as well as the aggregates, elements, and sense sources, are blessed to be the omniscient state.

source: །ཡང་ན་བྱིན་གྱི་རླབས་ཞེས་བྱ་བ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་རྗེས་སུ་འགྲོ་བ་ནི་ཤེས་རབ་ཀྱི་གནས་ཏེ།
en: Alternatively, ‘transformative power’ relates to the omniscient state, which is the abode of insight.

source: དེའི་ཕྱིར་བདག་གིས་ལུས་འདོམ་གང་ཙམ་པོ་འདི་ལ་འཇིག་རྟེན་གདགས་པར་བྱའོ།
en: That is why one’s body, which is just a fathom tall, should be thought of as the world.

source: །འཇིག་རྟེན་ཀུན་འབྱུང་བ་དང་འཇིག་རྟེན་འགོག་པ་དང་འཇིག་རྟེན་འགོག་པར་འགྲོ་བའི་ལམ་དང་། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་བར་ཡང་གདགས་པར་བྱའོ་སྙམ་པ་སྟེ།
en: It should be thought of as the source of the world, the end of the world, the path that leads to the end of the world, and also as the wisdom of omniscience.

source: དེ་ནི་ཤེས་རབ་ཀྱི་བྱིན་གྱི་རླབས་ཞེས་བྱའོ།
en: That is the transformative power of insight.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དུ་ཞིག་དང་ལྡན་ན་རབ་ཏུ་ཞི་བའི་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་འདི་འཐོབ།དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: At this point, Mañjuśrī Kumārabhūta asked the Blessed One, “Blessed One, what are the powers that bodhisattva great beings must possess in order to attain this absorption of the miraculous ascertainment of peace?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་སུམ་ཅུ་རྩ་དྲུག་དང་ལྡན་ན་རབ་ཏུ་ཞི་བའི་རྣམ་པར་ངེས་པའི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་སྟེ།
en: The Blessed One replied to Mañjuśrī Kumārabhūta, “Mañjuśrī, there are thirty-six pure wisdom powers that bodhisattva great beings must possess to attain the absorption of the miraculous ascertainment of peace.

source: སུམ་ཅུ་རྩ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སྨོན་ལམ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དགེ་བའི་རྩ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཡོངས་སུ་བསྔོ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཐོས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ལས་ཀྱི་སྒྲིབ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཆོ་ག་དང་སྤྱོད་ཡུལ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། དྲན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། ཐབས་ལ་མཁས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། སེམས་ཅན་ལ་དམིགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་། མཚན་མ་ལ་དམིགས་པའི་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: What are these thirty-six powers? They are the wisdom power of pure altruism, the wisdom power of pure aspiration, the wisdom power of pure roots of virtue, the wisdom power of pure dedication, the wisdom power of pure learning, the wisdom power of purified karmic obscuration, the wisdom power of pure ritual and experience, the wisdom power of pure mindfulness, the wisdom power of pure skillfulness, the wisdom power of pure observation of beings, the wisdom power of pure observation of characteristics,

source: གཏོང་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure abandonment,

source: སེམས་ཅན་རྗེས་སུ་འཛིན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure acceptance of beings,

source: བྱམས་པ་ཆེན་པོ་ཡང་དག་པར་འགྲུབ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure and great love,

source: སྙིང་རྗེ་ཆེན་པོ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure and great compassion,

source: དགའ་བ་དང་བཏང་སྙོམས་ཆེན་པོ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure and great joy and sameness,

source: ཚུལ་ཁྲིམས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure discipline,

source: ཚུལ་ཁྲིམས་ཀྱིས་རྗེས་སུ་འཛིན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure acceptance of discipline,

source: བཟོད་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure patience,

source: བཟོད་པས་རྗེས་སུ་འཛིན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure acceptance of patience,

source: བརྩོན་འགྲུས་ཀྱི་བསམ་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure diligence,

source: བརྩོན་འགྲུས་ཡང་དག་པར་ལེན་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure application of diligence,

source: ཁམས་ལ་མཁས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure skillfulness regarding the elements,

source: བསམ་གཏན་ལ་མཁས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure skill in concentration,

source: ཞི་གནས་ལ་མཁས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure skill in tranquility,

source: ཤེས་རབ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure insight,

source: ཐོས་པ་རྣམ་པར་ངེས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure certainty with regard to learning,

source: འཇིག་རྟེན་པ་དང་འཇིག་རྟེན་ལས་འདས་པའི་རྣམ་པར་ངེས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure certainty with regard to both the worldly and the otherworldly,

source: ཤེས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of purified consciousness,

source: འདུས་བྱས་དང་འདུས་མ་བྱས་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of purified conditioned and unconditioned phenomena,

source: ལྷག་མཐོང་ལ་མཁས་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure skill in special insight,

source: རིག་པ་དང་རྣམ་པར་གྲོལ་བ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure knowledge and liberation,

source: མི་སྐྱེ་བ་ལ་བཟོད་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure patience with regard to unborn phenomena,

source: མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of the pure characteristic beyond characteristics,

source: དོན་དམ་པ་དང་ཀུན་རྫོབ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་དང་།
en: the wisdom power of pure ultimate and relative truths,

source: འདུན་པ་དང་བརྩོན་འགྲུས་ཚད་མེད་པ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཏེ།
en: and the wisdom power of pure yearning and diligence.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་དག་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་སུམ་ཅུ་རྩ་དྲུག་པོ་དེ་དག་དང་ལྡན་ན་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་འདི་འཐོབ་བོ།
en: Mañjuśrī, when bodhisattva great beings possess these thirty-six pure wisdom powers, they attain the absorption of the miraculous ascertainment of peace.

source: །འཇམ་དཔལ་ཡོངས་སུ་བརྟག་པ་ཉེ་བར་བཟུང་སྟེ།
en: “Mañjuśrī, consider this contemplation.

source: བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལས་འཇིག་རྟེན་གྱི་ཁམས་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་བསྐལ་པར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འཇིག་རྟེན་གྱི་ཁམས་རེ་རེར་ཡང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་དང་བཅས་པ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་བཅས་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་རྣམས་ལ་ལྷའི་ཟས་དང་། ལྷའི་རས་བཅོས་བུའི་ན་བཟའ་རྣམས་ཕུལ་བ་དང་། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་རྣམས་ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོས་རབ་ཏུ་བཀང་སྟེ།
en: Bodhisattvas may spend as many eons as there are atoms in ten universes making offerings in each of the world systems in the ten directions to as many buddhas, bodhisattvas, hearers, and solitary buddhas as there are grains of sand in the Ganges by providing them with divine meals, with clothes made from divine fabrics, and with as many world systems as there are atoms in all the world systems in the great trichiliocosm filled to the brim with wish-fulfilling jewels.

source: དབུལ་བ་ཕུལ་བ་དང་དེ་བཞིན་གཤེགས་པ་རེ་རེའི་ཕྱིར་ཡང་ནོར་བུ་རིན་པོ་ཆེ་སྣང་བ་ཐམས་ཅད་ཡང་དག་པར་བསགས་པའི་མཆོད་རྟེན་ཚད་འཛམ་བུའི་གླིང་ཙམ་དུ་ཡོད་པ། སྲིད་པའི་རྩེ་མོར་ཐུག་པ།
en: Having made these offerings, the bodhisattvas may then commemorate those thus-gone ones by building a memorial for each of them, each memorial as large as this world, made of gems in all colors, and reaching to the peak of existence.

source: ནོར་བུ་རིན་པོ་ཆེ་གློག་གི་སྒྲོན་མའི་ཁ་ཁྱེར་གྱིས་ཡོངས་སུ་བསྐོར་བ་ནོར་བུ་རིན་པོ་ཆེ་དབང་གི་རྒྱལ་པོའི་དྲ་བ་བྲེས་པ། རྒྱལ་མཚན་དང་བ་དན་སྒྲེང་བ། ཙན་དན་སྦྲུལ་གྱི་སྙིང་པོའི་བྱུག་པས་བསྐུས་པས།
en: They may then surround these memorials with a railing of glittering gems and adorn them with a latticework of wish-fulfilling gems and garlands of banners before anointing them with sandalwood incense.

source: འཇིག་རྟེན་གྱི་ཁམས་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་དག་བྱས་ཏེ།
en: In this way there would be as many offerings as there are atoms in ten universes.

source: མཆོད་རྟེན་རེ་རེ་ལ་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱིས་བསྐལ་པར་ལྷའི་མཆོད་པ་མཚུངས་པ་མེད་པར་བྱས་ཀྱང་
en: Finally, the bodhisattvas may offer incomparable divine offerings to each of the memorials for as many eons as there are atoms in ten buddha realms.On the other hand,

source: བྱང་ཆུབ་སེམས་དཔའ་གཞན་གང་གིས་དད་པས་ཏིང་ངེ་འཛིན་འདི་ལ་མོས་ནས།ཐ་ན་དུད་འགྲོའི་སྐྱེ་གནས་སུ་སོང་བའི་སེམས་ཅན་ལ་ཟན་ཆང་གཅིག་ཙམ་བྱིན་ན་བསོད་ནམས་མངོན་པར་འདུ་བྱེད་པ་དེ་ལ་བསོད་ནམས་མངོན་པར་འདུ་བྱ་བ་སྔ་མས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ།
en: other bodhisattvas may faithfully aspire to this absorption and, because of that, offer something as simple as a single meal to a being who has been born as an animal. Compared to the merit created by these latter bodhisattvas, the merit created by the former bodhisattvas would not equal even one percent of it.

source: །སྟོང་གི་ཆ་དང་བརྒྱ་སྟོང་གི་ཆ་དང་བྱེ་བ་བརྒྱའི་ཆ་དང་བྱེ་བ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་དཔེ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ།
en: Nor would it equal a thousandth, a hundred thousandth, a billionth, a ten billionth, or a trillionth of that. In fact, no example or comparison would suffice.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཏིང་ངེ་འཛིན་འདི་ལ་དད་དེ། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱི་བསྙེན་བཀུར་བྱས་པ་བས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གང་ཏིང་ངེ་འཛིན་འདི་ལ་མཆོག་ཏུ་འཇུག་ན་དེ་དེ་བས་བསོད་ནམས་ཆེས་གྲངས་མེད་པར་སྐྱེད་དོ།
en: “Mañjuśrī, compared to bodhisattvas who first develop trust in this absorption and then render service to as many blessed buddhas as there are atoms in all the world systems in the ten directions, providing them with all kinds of pleasures, other bodhisattvas who properly immerse themselves in this absorption will create uncountably greater merit.

source: །འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་གང་ལ་ལ་ཞིག་གིས་བསྐལ་པ་ཁྲིར་དཀོན་མཆོག་གསུམ་ལ་དབུལ་བ་ཕུལ་བ་བས་བྱང་ཆུབ་སེམས་དཔའ་གཞན་གང་གིས་རབ་ཏུ་ཞི་བ་རྣམ་པར་ངེས་པའི་ཆོ་འཕྲུལ་གྱི་ཏིང་ངེ་འཛིན་འདིའི་མིང་ཐོས་ཏེ། ཐོས་ནས་ཀྱང་ཐ་ན་ཡུད་ཙམ་ཞིག་ཉན་འདོད་པར་གྱུར་ན་དེ་དེ་བས་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་བྱེད་པའི་བསོད་ནམས་ཆེས་གྲངས་མེད་པར་སྐྱེད་པར་འགྱུར་རོ།
en: Mañjuśrī, compared to bodhisattvas who make offerings to the Three Jewels for ten thousand eons, other bodhisattvas who hear the name of this absorption of the miraculous ascertainment of peace and just briefly form the wish to hear this teaching will develop inconceivably more merit in terms of attaining the wisdom of the Buddha.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ།
en: Then the Blessed One spoke these verses:

source: །དྲན་པ་ལྡན་ཞིང་བློ་གྲོས་ལྡན།
en: “Being mindful and intelligent,

source: །ཤེས་རབ་ལྡན་པ་མི་འཇིགས་པ།
en: Insightful and fearless,

source: །དེ་ནི་ཚེ་རབས་ཐམས་ཅད་དུ།
en: Throughout all lifetimes—

source: །བྱང་ཆུབ་སྤྱད་པ་སྤྱོད་པར་འགྱུར།
en: This is the practice of awakening.

source: །སངས་རྒྱས་འབྱུང་བ་རབ་མཛེས་པ། །སྐད་ཅིག་གཅིག་ལ་མཉེས་བྱེད་ན། །གང་དག་ངས་ནི་སྔོན་བཤད་པ།།མི་ཁོམ་བརྒྱད་རྣམས་རྣམ་པར་སྤོང་།
en: “If beings are delighted for even a moment By the splendid arising of the Buddha, They abandon the eight inopportune states Of which I have spoken previously.

source: །གཟུགས་དང་ཁ་དོག་ཕུན་སུམ་ཚོགས།
en: “They obtain a perfect body and hue,

source: །མཚན་རྣམས་ཀྱིས་ཀྱང་ལེགས་པར་བརྒྱན།
en: Beautifully adorned with all the marks,

source: །མཐུ་སྟོབས་དང་ཡང་རབ་ཏུ་ལྡན།
en: Strong and powerful,

source: །ལེ་ལོ་འདོད་པར་ཡོད་མི་འགྱུར།
en: And without any indolent desires.

source: །སྐྱིད་ཅིང་ནོར་ཡང་ཆེན་པོར་འགྱུར།
en: “They become happy, wealthy,

source: །བསོད་ནམས་ལྡན་ཞིང་རྫུ་འཕྲུལ་ཆེ།
en: And meritorious, and they gain miraculous abilities.

source: །འཇིག་རྟེན་སྣང་བྱེད་མཐོང་ནས་ཀྱང་།
en: Witnessing the sun of the world,

source: །ཕྱི་ཕྱིར་ཞིང་ནི་མཆོད་པ་བྱེད།
en: Again and again they pay homage.

source: །བདག་མེད་སྟོང་པ་ཐོས་ནས་ཀྱང་།
en: “As they hear the teaching on no-self and emptiness,

source: །དེ་ནི་ཆོས་ལ་མི་རྨོངས་ཏེ།
en: They are without confusion regarding the Dharma.

source: །ཆོས་རྣམས་ཇི་བཞིན་མཁས་པ་ནི།
en: Being learned regarding the nature of phenomena,

source: །དད་པ་མྱུར་དུ་རབ་ཏུ་ཐོབ།
en: They quickly develop devotion.

source: །རིགས་ཀྱི་མཆོག་དང་མོད་པ་དང་། །སྐྱིད་པ་དག་ཏུ་སྐྱེ་བར་འགྱུར།
en: “Being of noble birth and with wealth, They will always enjoy happiness.

source: །སྦྱིན་པའི་བདག་པོ་དཔའ་བོར་འགྱུར།
en: They become courageous benefactors

source: །སེར་སྣ་མེད་ཅིང་ལྷུག་པར་གཏོང་།
en: Who give freely without miserliness.

source: །གང་དག་ལ་ལ་འཛམ་གླིང་དུ།།ཁྱད་པར་འཕགས་པ་མཛེས་པར་རིགས།།དེར་ནི་བརྟེན་པ་སྐྱེས་པ་དང་།
en: “They will be born in the houses Of those in the world Who are uniquely noble and of illustrious family,

source: །སྨད་པའི་འགྲོ་བར་མ་ཡིན་དང་།
en: And they will not take unfortunate rebirths.

source: །སྐྱེ་བ་ཀུན་ཏུ་འདི་ལྟ་བུར།
en: “In all such lives,

source: །ཁྱིམ་བདག་དབང་ཆེར་གྲགས་པ་དང་། །དཔལ་དང་གཟི་བརྗིད་འཕགས་པ་ཡང་།
en: They will be powerful and renowned householders. Glory and splendor will be theirs

source: །ཚུལ་འདིར་ཡི་རང་སྤྱད་པར་འགྱུར།
en: As they rejoice in this way of practice.

source: །བྲམ་ཟེ་སཱ་ལ་ཆེ་འདྲ་བ།
en: “As brahmins as mighty as the sāla tree,

source: །ཚུལ་ཁྲིམས་ལྡན་དང་མང་ཐོས་འགྱུར།
en: They will be disciplined and learned.

source: །རྒྱལ་རིགས་སཱ་ལ་ཆེ་འདྲ་བ།
en: As rulers as mighty as the sāla tree,

source: །བསོད་ནམས་མཛོད་ཀྱིས་འཕགས་པ་ཡི།
en: “Exalted by means of their treasury of merit,

source: །རྒྱལ་པོ་རྫུ་འཕྲུལ་ཆེར་འགྱུར་ཏེ། །རྒྱ་མཚོར་བཅས་དང་རིར་བཅས་ཀྱི། །ས་ལ་ཆོས་ཀྱི་སྟོན་པར་འགྱུར།
en: They will become kings with miraculous abilities. They will become teachers of the Dharma, Teaching in the world with its oceans and central mountain.

source: །རིན་ཆེན་བདུན་གྱི་དབང་ཕྱུག་ཆེ།
en: “They will be lords possessing the seven riches.

source: །འཁོར་ལོས་སྒྱུར་བ་རྒྱལ་དབང་འགྱུར།
en: They will be powerful universal monarchs.

source: །རྒྱལ་པོར་གནས་ནས་སངས་རྒྱས་ལ།
en: As kings they will pay their respects

source: །ཕྱི་ཕྱིར་བསྟི་སྟང་བྱེད་པར་འགྱུར།
en: To the Buddha again and again.

source: །ཤི་འཕོས་ནས་ནི་མཐོ་རིས་འགྲོ། །སངས་རྒྱས་བསྟན་ལ་དད་པར་འགྱུར།
en: “As they pass away, they will go to the higher realms, Where they will develop faith in the teaching of the Buddha.

source: །རི་རབ་རྩེ་མོའི་དབང་ཕྱུག་པོ།།ལྷ་ཡི་དབང་པོ་བརྒྱ་བྱིན་འགྱུར།
en: They will be born as Śakra, ruler of the gods, The lord ruling the peak of the central mountain.

source: །ལྷ་དབང་འཐབ་བྲལ་རབ་ཏུ་འགྱུར།
en: “As rulers of the gods, they will be born in the Heaven Free from Strife,

source: །དེ་བཞིན་ཡོངས་སུ་དགའ་ལྡན་འགྱུར།
en: And likewise in the Heaven of Joy.

source: །ལྷ་དབང་རབ་ཏུ་འཕྲུལ་པ་དང་།
en: As rulers of the gods they employ emanations;

source: །དབང་བྱེད་འཇིགས་པ་མེད་པར་འགྱུར།
en: They are powerful and fearless.

source: །ཚུལ་འདིར་ཡི་རང་བྱས་པ་ནི།
en: “Rejoicing in this way of practice,
